TESTE_FUNCIONAL_10032025-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: TESTE FUNCIONAL 10032025-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: TESTE FUNCIONAL 10032025-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  TESTE FUNCIONAL 10032025-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Test
      actions:
      - resizeWindow(1440,765)
      - go(https://blazedemo.com/index.php)
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)
      - waitForCSS(input.btn.btn-small): "Clickable"
      - clickByCSS(input.btn.btn-small)
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "aless"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(inputName): "Clickable"
      - clickByID(inputName)
      - waitForID(inputName): "Clickable"
      - typeByID(inputName): "alessS"
      - waitForID(address): "Clickable"
      - clickByID(address)
      - waitForID(address): "Clickable"
      - typeByID(address): "alessandro"
      - waitForID(city): "Clickable"
      - typeByID(city): "ale"
      - waitForID(state): "Clickable"
      - typeByID(state): "SP"
      - waitForID(zipCode): "Clickable"
      - typeByID(zipCode): "13545"
      - waitForID(creditCardNumber): "Clickable"
      - clickByID(creditCardNumber)
      - waitForID(creditCardNumber): "Clickable"
      - typeByID(creditCardNumber): "0000000000000000"
      - waitForID(nameOnCard): "Clickable"
      - clickByID(nameOnCard)
      - waitForID(nameOnCard): "Clickable"
      - typeByID(nameOnCard): "alessandro c"
      - waitForCSS(input.btn.btn-primary): "Clickable"
      - clickByCSS(input.btn.btn-primary)

  TESTE FUNCIONAL 10032025-Http:
    headers:
      sec-ch-ua: '"Chromium";v="134", "Not:A-Brand";v="24", "Google Chrome";v="134"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      Content-Type: application/x-www-form-urlencoded
      Upgrade-Insecure-Requests: '1'
      User-Agent: >-
        Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML,
        like Gecko) Chrome/134.0.0.0 Safari/537.36
      Accept: >-
        text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      sec-ch-ua-arch: '"x86"'
      sec-ch-ua-platform-version: '"19.0.0"'
      sec-ch-ua-model: '""'
      sec-ch-ua-bitness: '"64"'
      sec-ch-ua-wow64: '?0'
      sec-ch-ua-full-version-list: >-
        "Chromium";v="134.0.6998.89", "Not:A-Brand";v="24.0.0.0", "Google
        Chrome";v="134.0.6998.89"
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: https://blazedemo.com/reserve.php
            method: POST
            label: https://blazedemo.com/reserve.php
            think-time: 0ms
            headers: {}
            body:
              fromPort: Paris
              toPort: Buenos Aires
          - url: https://blazedemo.com/purchase.php
            method: POST
            label: https://blazedemo.com/purchase.php
            think-time: 2867ms
            headers: {}
            body:
              airline: Virgin America
              flight: '43'
              fromPort: Paris
              price: '472.56'
              toPort: Buenos Aires
          - url: https://blazedemo.com/confirmation.php
            method: POST
            label: https://blazedemo.com/confirmation.php
            think-time: 32535ms
            headers: {}
            body:
              _token: ''
              address: alessandro
              cardType: visa
              city: ale
              creditCardMonth: '11'
              creditCardNumber: '0000000000000000'
              creditCardYear: '2017'
              inputName: alessS
              nameOnCard: alessandro c
              state: SP
              zipCode: '13545'